{"backend": "tensorflow", "config": [{"config": {"kernel_constraint": null, "name": "dense_1", "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "units": 9, "batch_input_shape": [null, 9], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "name": "dense_2", "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "units": 5, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "name": "dense_3", "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "units": 3, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "dtype": "float32"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.3-tf"}